## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.audit_logs_archiver`        |
|        | `aws_lambda_event_source_mapping.audit_logs_archiver` |
|        | `aws_lambda_function.audit_logs_archiver`             |
|        | `aws_s3_object.audit_logs_archiver_code`              |
| update | `aws_iam_policy.lambda_dynamodb`                      |
|        | `aws_iam_policy.lambda_s3`                            |
|        | `aws_lambda_function.audit_logs`                      |
|        | `aws_lambda_function.vault_integrity`                 |
|        | `aws_s3_object.audit_logs_code`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.audit_logs_archiver will be created
  + resource "aws_cloudwatch_log_group" "audit_logs_archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Audit_Logs_Archiver"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id          = "arn:aws:iam::687401027353:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (5 unchanged elements hidden)
                            "arn:aws:dynamodb:ca-central-1:687401027353:table/AuditLogs",
                          + "arn:aws:dynamodb:ca-central-1:000000000000:table/AuditLogs/stream/2023-10-30T19:33:04.980",
                        ]
                      - Sid      = ""
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id          = "arn:aws:iam::687401027353:policy/lambda_s3"
        name        = "lambda_s3"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (5 unchanged elements hidden)
                            "arn:aws:s3:::forms-staging-lambda-code",
                          + "arn:aws:s3:::forms-staging-audit-logs-archive-storage/*",
                          + "arn:aws:s3:::forms-staging-audit-logs-archive-storage",
                            "arn:aws:s3:::forms-staging-archive-storage/*",
                            # (1 unchanged element hidden)
                        ]
                      - Sid      = ""
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.audit_logs_archiver will be created
  + resource "aws_lambda_event_source_mapping" "audit_logs_archiver" {
      + batch_size                         = 100
      + bisect_batch_on_function_error     = true
      + enabled                            = true
      + event_source_arn                   = "arn:aws:dynamodb:ca-central-1:000000000000:table/AuditLogs/stream/2023-10-30T19:33:04.980"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 60
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = 3
      + parallelization_factor             = 5
      + starting_position                  = "LATEST"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)

      + destination_config {
          + on_failure {
              + destination_arn = "arn:aws:sqs:ca-central-1:000000000000:audit_logs_archiver_deadletter_queue"
            }
        }

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName    = [
                          + "REMOVE",
                        ]
                      + userIdentity = {
                          + principalId = [
                              + "dynamodb.amazonaws.com",
                            ]
                          + type        = [
                              + "Service",
                            ]
                        }
                    }
                )
            }
        }
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "30DMkTP0oJkmf94PSeysgJpD70IqbQX0" -> (known after apply)
      ~ source_code_hash               = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "uA1Hry4y0dcgzeKX5uPzLgtTt3KSTQrdYmKrEkxI2C0="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be created
  + resource "aws_lambda_function" "audit_logs_archiver" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Audit_Logs_Archiver"
      + handler                        = "audit_logs_archiver.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "forms-staging-lambda-code"
      + s3_key                         = "audit_logs_archiver_code"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "cAME1fLhcl6bytAqdrc6zNEg/BIMGOXsVqIs1V49k9g="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUDIT_LOGS_ARCHIVE_STORAGE_S3_BUCKET" = "forms-staging-audit-logs-archive-storage"
              + "LOCALSTACK"                           = "false"
              + "REGION"                               = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-01-25T17:03:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_archiver_code will be created
  + resource "aws_s3_object" "audit_logs_archiver_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "audit_logs_archiver_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/audit_logs_archiver_code.zip"
      + source_hash            = "cAME1fLhcl6bytAqdrc6zNEg/BIMGOXsVqIs1V49k9g="
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "uA1Hry4y0dcgzeKX5uPzLgtTt3KSTQrdYmKrEkxI2C0="
        tags                   = {}
      ~ version_id             = "30DMkTP0oJkmf94PSeysgJpD70IqbQX0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
